app/views/profiles/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
          <p>
           Posts: <%= @user.posts.count %>