app/views/notifications/_notification_dropdown.html.erb

    <button class="btn btn-default dropdown-toggle" type='button', id='dropdownMenu1', data-toggle='dropdown', aria-haspopup='true', aria-expanded='true'>
        <%= current_user.notifications.where(read:nil).count %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" = $2  [["user_id", 1], ["read", false]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" = $2  [["user_id", 1], ["read", false]]

        <li class="dropdown-header text-center">Notifications</li>
            <%= render current_user.notifications.where(read:nil).last(5).reverse %>
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" IS NULL ORDER BY "notifications"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 5]]