app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.build(comment_params)
        @comment.user_id = current_user.id

        respond_to do |format|
            if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["post_id", 5], ["content", "cute cat"], ["created_at", "2018-07-25 07:13:28.338285"], ["updated_at", "2018-07-25 07:13:28.338285"]]

    def destroy
        @comment = @post.comments.find(params[:id])

        @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 8], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]

    def create_notification(post, comment)
        return if post.user.id == current_user.id
        Notification.create(user_id: post.user.id,
                            notified_by_id: current_user.id,
                            post_id: post.id,
                            identifier: comment.id,
                            notice_type: 'comment')
---
INSERT INTO "notifications" ("user_id", "notified_by_id", "post_id", "identifier", "notice_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["notified_by_id", 1], ["post_id", 8], ["identifier", 11], ["notice_type", "comment"], ["created_at", "2018-07-27 02:08:55.504727"], ["updated_at", "2018-07-27 02:08:55.504727"]]