app/controllers/notifications_controller.rb

  def link_through
    @notification = Notification.find(params[:id])
    @notification.update read: true
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", true], ["updated_at", "2018-07-27 05:47:26.746445"], ["id", 6]]