app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.order('created_at DESC').page params[:page]

INSERT INTO "posts" ("caption", "created_at", "updated_at", "image", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["caption", "I am a dog"], ["created_at", "2018-07-25 01:39:51.752377"], ["updated_at", "2018-07-25 01:39:51.752377"], ["image", "jrzjkqcnlcftfbsitfxj.jpg"], ["user_id", 2]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image" = 'image/upload/v1532482795/jrzjkqcnlcftfbsitfxj.jpg' WHERE "posts"."id" = $1  [["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

INSERT INTO "notifications" ("user_id", "notified_by_id", "post_id", "identifier", "notice_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["notified_by_id", 2], ["post_id", 5], ["identifier", 5], ["notice_type", "like"], ["created_at", "2018-07-27 08:13:14.886959"], ["updated_at", "2018-07-27 08:13:14.886959"]]
---
    def create_notification(post)
      return if post.user == current_user
      Notification.create(user_id: post.user.id,
                          notified_by_id: current_user.id,
                          post_id: post.id,
                          identifier: post.id,
                          notice_type: 'lik')