app/controllers/profiles_controller.rb

  def show
    @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "foobar"], ["LIMIT", 1]]

  def edit
    @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "akira"], ["LIMIT", 1]]

  def update
    @user = User.find_by(user_name: params[:user_name])
    if @user.update(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "akira"], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "bio" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["avatar", "xdlqd4wdrgvt8u3vxgr5.jpg"], ["bio", "I like to snack a lot"], ["updated_at", "2018-07-25 13:24:50.830614"], ["id", 2]]

  def owned_profile
    @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "akira"], ["LIMIT", 1]]

  def set_user
    @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "akira"], ["LIMIT", 1]]